Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG00-S1/svd/PIC32CK2051SG00100S1.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>EXTDMA</name>
         <description>External DMA Module</description>
         <groupName>EXTDMA</groupName>
         <prependToName>EXTDMA_</prependToName>
         <baseAddress>0x52000800</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x40</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>FETCH_ADDR_LSB</name>
               <description>Lower Fetch Address</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FETCH_ADDR_MSB</name>
               <description>Upper Fetch Address</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>FETCH_LEN</name>
               <description>Fetch Length</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LEN</name>
                     <description>Length of data block</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>28</bitWidth>
                  </field>
                  <field>
                     <name>CST_ADDR</name>
                     <description>CST Address</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REALIGN</name>
                     <description>Realign</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FETCH_TAG</name>
               <description>Fetch Tag</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TAG</name>
                     <description>User TAG</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PUSH_ADDR_LSB</name>
               <description>Lower Push Address</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PUSH_ADDR_MSB</name>
               <description>Upper Fetch Address</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PUSH_LEN</name>
               <description>Push Length</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LEN</name>
                     <description>Length of data block</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>28</bitWidth>
                  </field>
                  <field>
                     <name>CST_ADDR</name>
                     <description>CST Address</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REALIGN</name>
                     <description>Realign</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INT_EN</name>
               <description>Interrupt Enable</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>INT_ENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>INT_ENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>INT_STATRAW</name>
               <description>Interrupt Raw Status</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>INT_STAT</name>
               <description>Interrupt Status</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>INT_STAT_CLR</name>
               <description>Interrupt Status Clear</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>CONFIG</name>
               <description>Configuraiton</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FETCHER_SCATTER_GATHER</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PUSHER_SCATTER_GATHER</name>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STOP_PUSHER</name>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STOP_FETCHER</name>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOFTWARE_RESET</name>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>START</name>
               <description>Start</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>START_FETCH</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>START_PUSH</name>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>Stop</description>
               <addressOffset>0x3C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FETCHER_BUSY</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PUSHER_BUSY</name>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSY_FLAG</name>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FETCHER_NOT_EMPTY</name>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PUSHER_WAITING_FIFO</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BYTES_NUMBER</name>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
